WELCOME_TEXT = """
<b>🏡 Добро пожаловать в нашу компанию по остеклению!</b>  

Хотите превратить свое пространство в <b>теплое, стильное и безопасное место</b>?  
Мы поможем вам с этим!  

✅ <b>Панорамное остекление</b>  
✅ <b>Надежные алюминиевые и ПВХ-системы</b>  
✅ <b>Качественный ремонт и замена стеклопакетов</b>  
✅ <b>Шумоизоляция и защита от погодных условий</b>  

📩 <b>Оставьте заявку прямо сейчас</b>, и наш эксперт подберет для вас идеальное решение!  

Выберите нужный раздел ниже и сделайте шаг к уюту и комфорту! 👇  
"""

WELCOME_TEXT_PHOTO='AgACAgIAAxkBAAILP2fuOJlLa2b-BTJrz9dgRomfTfQDAAJ_8DEbiet5S9zXl-fZvqvwAQADAgADeQADNgQ'




FAQ_DATA = {
    "order": ("Как оформить заказ?", "📌 Вы можете оставить заявку в боте, и наш менеджер свяжется с вами."),
    "price": ("Сколько стоит услуга?", "💰 Цена зависит от ваших требований. Вы можете рассчитать стоимость в боте."),
    "payment": ("Какие способы оплаты?", "💳 Мы принимаем оплату картой, переводом и наличными."),
    "delivery": ("Как осуществляется доставка?", "🚚 Мы доставляем заказы по городу и области. Подробнее у менеджера."),
    "guarantee": ("Есть ли гарантия на услуги?", "✅ Да, мы предоставляем гарантию на наши услуги. Подробности уточняйте."),
    "discounts": ("Есть ли скидки или акции?", "🎁 У нас действуют акции! Узнайте текущие предложения у менеджера."),
    "time": ("Какой срок выполнения заказа?", "⏳ Время выполнения зависит от сложности заказа. Средний срок — 2-3 дня."),
    "contact": ("Как связаться с менеджером?", "📞 Вы можете написать в Telegram или позвонить по телефону."),
    "change": ("Можно ли изменить заказ после оформления?", "🔄 Да, но изменения возможны до начала выполнения."),
    "refund": ("Как вернуть деньги, если меня не устроила услуга?", "💸 Мы работаем по договору. Возможность возврата обсуждается индивидуально.")
}

ADMIN_WELCOME_TEXT= """
    Приветствую в админ-панели! 👋

    ⚙️ Добро пожаловать в панель управления вашим ботом. Здесь вы можете:

    1️⃣ Управлять примерами работ (добавлять, удалять, редактировать).
    2️⃣ Просматривать все заявки от пользователей и отвечать на них.
    3️⃣ Управлять контактами и связываться с пользователями.
    4️⃣ Редактировать часто задаваемые вопросы (FAQ).
    
    📍 Важная информация:
    🔒 Доступ к админ-панели только у авторизованных администраторов.

    Для управления выберите нужное действие из меню ниже.
    """